Reports/РСК_КалендарныйГрафикПоставок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>РСК_КалендарныйГрафикПоставок</Name>
			<Comment>РС Консалт: Трофимов Евгений 18.07.2022 Задача 19014</Comment>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/РСК_ТоварыКПартиямПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>РСК_ТоварыКПартиямПоставки</Name>
			<Comment>РС Консалт: Трофимов Евгений 05.07.2022 №18725</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПриобретениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриобретениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеТоваровНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеТоваровНаСклад</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Удалить_РС_СкладНакладной</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РегистрироватьЦеныПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидЗапасов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НоменклатураПартнера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаУчетаНоменклатурыНакладной</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыЗапасов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АналитикаУчетаНоменклатурыНакладной</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТДНакладной</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/РСК_КалендарныйГрафикПоставок/Ext/ObjectModule.bsl
Перем Имя;

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);

	//++ РС Консалт: Трофимов Евгений 12.11.2022 Тикет 21859
	//e1cib/data/Документ.Задание?ref=bfe6392c3b612d934b6f8f4f1aeb17ad
	//Было:
	//КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекущаяДата", ТекущаяДатаСеанса(), Истина);
	//КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
	//	КомпоновщикНастроек, 
	//	"ПользовательИмеетПраваПросматриватьСуммы", 
	//	РСК_ВызовСервера.ЕстьРоль("РСК_РедакторПартийПоставок"), 
	//	Истина, 
	//	Истина
	//);
	//
	//СтандартнаяОбработка = Ложь;
	//КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	//Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки);
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//
	//ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1);  //не работает на платформе 8.3.20.1789
	
	//Стало:
	//Нужно выполнять запрос без контроля прав доступа, иначе пользователя b2g не видно колонки Заказано и Приход
	//Поэтому отчёт из СКД переехал в обычный запрос
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапроса = Новый Структура;
	НастройкиПользователя = КомпоновщикНастроек.ПолучитьНастройки();
	Парам = НастройкиПользователя.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
	Если Парам <> Неопределено И Парам.Использование Тогда
		ПараметрыЗапроса.Вставить("ПериодОтчета", Парам.Значение);
	КонецЕсли;
	
	ВнешнийНабор = Новый Структура;
	ВнешнийНабор.Вставить("ВнешниеДанные", ПолучитьТаблицуОтчета(ПараметрыЗапроса));
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиПользователя = КомпоновщикНастроек.ПолучитьНастройки();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиПользователя,ДанныеРасшифровки);
	
	ПроцессорКомпановки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпановки.Инициализировать(МакетКомпоновки,ВнешнийНабор,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпановки);
	
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1);
	//-- КонецТикета 21859	
	
КонецПроцедуры

Функция ПолучитьТаблицуОтчета(ПараметрыЗапроса)

	Запрос = Новый Запрос(ТекстЗапроса());
	Если ПараметрыЗапроса.Свойство("ПериодОтчета") Тогда
		Запрос.УстановитьПараметр("НачалоПериода", ПараметрыЗапроса.ПериодОтчета.ДатаНачала);
		Запрос.УстановитьПараметр("КонецПериода", ПараметрыЗапроса.ПериодОтчета.ДатаОкончания);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НачалоПериода, &КонецПериода", ",");
	КонецЕсли;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПользовательИмеетПраваПросматриватьСуммы", РСК_ВызовСервера.ЕстьРоль("РСК_РедакторПартийПоставок"));
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьТаблицуОтчета()

Функция ТекстЗапроса()

	Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(РСК_ПартияПоставкиТовары.Ссылка.Номер, """") КАК НомерПоставки,
		|	РСК_ТоварыКПартиямПоставкиОбороты.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ЕСТЬNULL(РСК_ПартияПоставкиТовары.Количество, РСК_ТоварыКПартиямПоставкиОбороты.КоличествоПриход) КАК Заказано,
		|	докЗаказПоставщику.НомерПоДаннымПоставщика КАК НомерЗаказаНаПроизводство,
		|	ЗаказПоставщикуТовары.Номенклатура.Артикул КАК Артикул,
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	ЗаказПоставщикуТовары.Серия КАК Серия,
		|	докЗаказПоставщику.Статус КАК СтатусЗаказа,
		|	ЕСТЬNULL(РСК_ПартияПоставкиТовары.Ссылка.СтатусПартии, ЗНАЧЕНИЕ(Перечисление.РСК_СтатусыПартийПоставки.ПустаяСсылка)) КАК СтатусПартии,
		|	докЗаказПоставщику.ДатаСогласования КАК ДатаСогласования,
		|	ЕСТЬNULL(РСК_ПартияПоставкиКонтейнеры.ДатаЗагрузкиКонтейнера, ВЫБОР
		|			КОГДА докЗаказПоставщику.ПоступлениеОднойДатой
		|				ТОГДА докЗаказПоставщику.ДатаОтгрузки
		|			ИНАЧЕ ЗаказПоставщикуТовары.ДатаОтгрузки
		|		КОНЕЦ) КАК ДатаЗавершенияПроизводства,
		|	ЕСТЬNULL(РСК_ПартияПоставкиТовары.Ссылка.ДатаЕТА, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриходаВПорт,
		|	РСК_ТоварыКПартиямПоставкиОбороты.НомерСтрокиЗаказа КАК НомерСтрокиЗаказа,
		|	ЕСТЬNULL(ЕСТЬNULL(РСК_ПартияПоставкиКонтейнеры.ДокументПриобретения, ПриобретениеБезКонтейнера.Ссылка), ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)) КАК ДокументПриобретения,
		|	ВЫБОР
		|		КОГДА докЗаказПоставщику.ПоступлениеОднойДатой
		|			ТОГДА докЗаказПоставщику.ДатаПоступления
		|		ИНАЧЕ ЗаказПоставщикуТовары.ДатаПоступления
		|	КОНЕЦ КАК ДатаПоступления,
		|	РСК_ТоварыКПартиямПоставкиОбороты.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.Количество > 0
		|				И &ПользовательИмеетПраваПросматриватьСуммы
		|			ТОГДА ЗаказПоставщикуТовары.СуммаСНДС / ЗаказПоставщикуТовары.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаТовараВЗакзе,
		|	ЕСТЬNULL(РСК_ПартияПоставкиКонтейнеры.СтатусКонтейнера, ЗаказПоставщикуТовары.Статус) КАК Статус
		|ПОМЕСТИТЬ Заказы
		|ИЗ
		|	РегистрНакопления.РСК_ТоварыКПартиямПоставки.Обороты(&НачалоПериода, &КонецПериода, Запись, {(ЗаказПоставщику)}) КАК РСК_ТоварыКПартиямПоставкиОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК докЗаказПоставщику
		|		ПО РСК_ТоварыКПартиямПоставкиОбороты.ЗаказПоставщику = докЗаказПоставщику.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РСК_ПартияПоставки.Товары КАК РСК_ПартияПоставкиТовары
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РСК_ПартияПоставки.Контейнеры КАК РСК_ПартияПоставкиКонтейнеры
		|				ПО РСК_ПартияПоставкиТовары.Ссылка = РСК_ПартияПоставкиКонтейнеры.Ссылка
		|					И РСК_ПартияПоставкиТовары.НомерКонтейнера = РСК_ПартияПоставкиКонтейнеры.НомерКонтейнера
		|			ПО ЗаказПоставщикуТовары.Ссылка = РСК_ПартияПоставкиТовары.ЗаказПоставщику
		|				И ЗаказПоставщикуТовары.КодСтроки = РСК_ПартияПоставкиТовары.КодСтроки
		|				И (РСК_ПартияПоставкиТовары.Ссылка.Проведен)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеБезКонтейнера
		|			ПО ЗаказПоставщикуТовары.Ссылка = ПриобретениеБезКонтейнера.ЗаказПоставщику
		|				И ЗаказПоставщикуТовары.КодСтроки = ПриобретениеБезКонтейнера.КодСтроки
		|				И (ПриобретениеБезКонтейнера.Ссылка.Проведен)
		|		ПО РСК_ТоварыКПартиямПоставкиОбороты.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
		|			И РСК_ТоварыКПартиямПоставкиОбороты.НомерСтрокиЗаказа = ЗаказПоставщикуТовары.КодСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказы.ЗаказПоставщику КАК ЗаказПоставщику,
		|	Заказы.НомерСтрокиЗаказа КАК НомерСтрокиЗаказа,
		|	Заказы.Номенклатура КАК Номенклатура,
		|	Заказы.Характеристика КАК Характеристика,
		|	Заказы.Серия КАК Серия,
		|	Заказы.ДокументПриобретения КАК ДокументПриобретения,
		|	Заказы.Заказано КАК Заказано,
		|	СУММА(ЕСТЬNULL(Заказы1.Заказано, 0)) - Заказы.Заказано КАК РанееУжеЗаказано
		|ПОМЕСТИТЬ ТоварыЗаказанные
		|ИЗ
		|	Заказы КАК Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Заказы КАК Заказы1
		|		ПО Заказы.ДокументПриобретения = Заказы1.ДокументПриобретения
		|			И Заказы.Номенклатура = Заказы1.Номенклатура
		|			И Заказы.Характеристика = Заказы1.Характеристика
		|			И Заказы.Серия = Заказы1.Серия
		|			И Заказы.НомерСтрокиЗаказа >= Заказы1.НомерСтрокиЗаказа
		|			И Заказы.ЗаказПоставщику >= Заказы1.ЗаказПоставщику
		|
		|СГРУППИРОВАТЬ ПО
		|	Заказы.Характеристика,
		|	Заказы.Номенклатура,
		|	Заказы.Серия,
		|	Заказы.ЗаказПоставщику,
		|	Заказы.ДокументПриобретения,
		|	Заказы.Заказано,
		|	Заказы.НомерСтрокиЗаказа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровНаСкладТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровНаСкладТовары.Характеристика КАК Характеристика,
		|	ПоступлениеТоваровНаСкладТовары.Серия КАК Серия,
		|	СУММА(ПоступлениеТоваровНаСкладТовары.Количество) КАК Количество,
		|	ПоступлениеТоваровНаСклад.Ссылка КАК ДокументПоступления,
		|	ПоступлениеТоваровНаСклад.Распоряжение КАК ДокументПриобретения
		|ПОМЕСТИТЬ ТоварыПолученные
		|ИЗ
		|	Документ.ПоступлениеТоваровНаСклад КАК ПоступлениеТоваровНаСклад
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаСклад.Товары КАК ПоступлениеТоваровНаСкладТовары
		|		ПО ПоступлениеТоваровНаСклад.Ссылка = ПоступлениеТоваровНаСкладТовары.Ссылка
		|ГДЕ
		|	ПоступлениеТоваровНаСклад.Распоряжение В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				Заказы.ДокументПриобретения КАК ДокументПриобретения
		|			ИЗ
		|				Заказы КАК Заказы
		|			ГДЕ
		|				Заказы.ДокументПриобретения <> ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка))
		|	И ПоступлениеТоваровНаСклад.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровНаСкладТовары.Номенклатура,
		|	ПоступлениеТоваровНаСкладТовары.Характеристика,
		|	ПоступлениеТоваровНаСкладТовары.Серия,
		|	ПоступлениеТоваровНаСклад.Ссылка,
		|	ПоступлениеТоваровНаСклад.Распоряжение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказы.НомерПоставки КАК НомерПоставки,
		|	Заказы.ЗаказПоставщику КАК ЗаказПоставщику,
		|	Заказы.Заказано КАК Заказано,
		|	Заказы.НомерЗаказаНаПроизводство КАК НомерЗаказаНаПроизводство,
		|	Заказы.Артикул КАК Артикул,
		|	Заказы.Номенклатура КАК Номенклатура,
		|	Заказы.Характеристика КАК Характеристика,
		|	Заказы.Серия КАК Серия,
		|	Заказы.СтатусЗаказа КАК СтатусЗаказа,
		|	Заказы.СтатусПартии КАК СтатусПартии,
		|	Заказы.ДатаСогласования КАК ДатаСогласования,
		|	Заказы.ДатаЗавершенияПроизводства КАК ДатаЗавершенияПроизводства,
		|	Заказы.ДатаПриходаВПорт КАК ДатаПриходаВПорт,
		|	Заказы.НомерСтрокиЗаказа КАК НомерСтрокиЗаказа,
		|	Заказы.ДокументПриобретения КАК ДокументПриобретения,
		|	ВЫБОР
		|		КОГДА Заказы.Заказано < ЕСТЬNULL(ТоварыПолученные.Количество, 0) - ТоварыЗаказанные.РанееУжеЗаказано
		|			ТОГДА Заказы.Заказано
		|		КОГДА ЕСТЬNULL(ТоварыПолученные.Количество, 0) >= ТоварыЗаказанные.РанееУжеЗаказано
		|			ТОГДА ЕСТЬNULL(ТоварыПолученные.Количество, 0) - ТоварыЗаказанные.РанееУжеЗаказано
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Получено,
		|	Заказы.Заказано - ВЫБОР
		|		КОГДА Заказы.Заказано < ЕСТЬNULL(ТоварыПолученные.Количество, 0) - ТоварыЗаказанные.РанееУжеЗаказано
		|			ТОГДА Заказы.Заказано
		|		КОГДА ЕСТЬNULL(ТоварыПолученные.Количество, 0) >= ТоварыЗаказанные.РанееУжеЗаказано
		|			ТОГДА ЕСТЬNULL(ТоварыПолученные.Количество, 0) - ТоварыЗаказанные.РанееУжеЗаказано
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОсталосьПолучить,
		|	Заказы.ДатаПоступления КАК ДатаПоступления,
		|	Заказы.Период КАК Период,
		|	ВЫБОР
		|		КОГДА Заказы.ДатаПриходаВПорт = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА -1
		|		ИНАЧЕ РАЗНОСТЬДАТ(&ТекущаяДата, Заказы.ДатаПриходаВПорт, ДЕНЬ)
		|	КОНЕЦ КАК ДнейДоПриходаВПорт,
		|	Заказы.Заказано * Заказы.ЦенаТовараВЗакзе КАК СуммаТовараЗаказанного,
		|	ВЫБОР
		|		КОГДА Заказы.Заказано < ЕСТЬNULL(ТоварыПолученные.Количество, 0) - ТоварыЗаказанные.РанееУжеЗаказано
		|			ТОГДА Заказы.Заказано
		|		КОГДА ЕСТЬNULL(ТоварыПолученные.Количество, 0) >= ТоварыЗаказанные.РанееУжеЗаказано
		|			ТОГДА ЕСТЬNULL(ТоварыПолученные.Количество, 0) - ТоварыЗаказанные.РанееУжеЗаказано
		|		ИНАЧЕ 0
		|	КОНЕЦ * Заказы.ЦенаТовараВЗакзе КАК СуммаТовараПолученного,
		|	(Заказы.Заказано - ВЫБОР
		|		КОГДА Заказы.Заказано < ЕСТЬNULL(ТоварыПолученные.Количество, 0) - ТоварыЗаказанные.РанееУжеЗаказано
		|			ТОГДА Заказы.Заказано
		|		КОГДА ЕСТЬNULL(ТоварыПолученные.Количество, 0) >= ТоварыЗаказанные.РанееУжеЗаказано
		|			ТОГДА ЕСТЬNULL(ТоварыПолученные.Количество, 0) - ТоварыЗаказанные.РанееУжеЗаказано
		|		ИНАЧЕ 0
		|	КОНЕЦ) * Заказы.ЦенаТовараВЗакзе КАК СуммаТовараОставшегося,
		|	Заказы.Статус КАК Статус,
		|	ЕСТЬNULL(ТоварыПолученные.ДокументПоступления, ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровНаСклад.ПустаяСсылка)) КАК ДокументПоступления
		|ИЗ
		|	Заказы КАК Заказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыЗаказанные КАК ТоварыЗаказанные
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТоварыПолученные КАК ТоварыПолученные
		|			ПО ТоварыЗаказанные.ДокументПриобретения = ТоварыПолученные.ДокументПриобретения
		|				И ТоварыЗаказанные.Номенклатура = ТоварыПолученные.Номенклатура
		|				И ТоварыЗаказанные.Характеристика = ТоварыПолученные.Характеристика
		|				И ТоварыЗаказанные.Серия = ТоварыПолученные.Серия
		|		ПО Заказы.ДокументПриобретения = ТоварыЗаказанные.ДокументПриобретения
		|			И Заказы.ЗаказПоставщику = ТоварыЗаказанные.ЗаказПоставщику
		|			И Заказы.НомерСтрокиЗаказа = ТоварыЗаказанные.НомерСтрокиЗаказа
		|";

	
	Возврат Текст;
КонецФункции // ТекстЗапроса()

Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.0.1.342");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = "3.0.0.0";
	ПараметрыРегистрации.Информация = "Разработчик: ООО ""РС Консалт"", тел.: (3812) 332-331"
	+Символы.ПС+"Автор: Евгений Трофимов, 2022"
	+Символы.ПС+"Добавлено "+ТекущаяДата()+" при версии БСП: "+СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = '"+Имя+"'");
	Команда.Идентификатор = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Имя);
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;
	Возврат ПараметрыРегистрации;
КонецФункции

Имя = ЭтотОбъект.Метаданные().Синоним;
